{"meta":{"title":"Alwaysfoolish","subtitle":"","description":"","author":"Alwaysfoolish","url":"http://yoursite.com","root":"/"},"pages":[],"posts":[{"title":"Built For You | 这里属于你 创造与毁灭","slug":"Built-for-you","date":"2020-03-19T13:18:02.000Z","updated":"2020-03-23T08:25:45.646Z","comments":true,"path":"2020/03/19/Built-for-you/","link":"","permalink":"http://yoursite.com/2020/03/19/Built-for-you/","excerpt":"","text":"Welcome to my blog.This is my first post. If you get any problems you can ask me on GitHub. Using Documents | 说明文档Create A Boyfriend | 创造一个男朋友 12#创造一个男朋友$ new a boyfriend More info: Writing Parameter | 参数设定1234567891011#程序启动之前输入参数#时间-----Please input the generation time.$ T--2020&#x2F;03&#x2F;11&#x2F;#地点-----Please input the place of encounter.$ P--Aloha More info: Writing Run | 执行程序123456789101112131415$ run command$ init #初始化-----Press ENTER or type command to continue.En***-----Congratulations!Your boyfriend has been successfully created!$ Robot --v #版本号-----AI_Boyfriend V1.0$ Robot --upgrade #版本升级-----AI_Boyfriend V93819 More info: Writing Here,Get Your Boyfriend | 成功创造1Hello world. More info: Server Destruction Plan | 毁灭计划（非政府强制）12345678910111213141516171819202122Introduction:You can run the destruction plan when something special happens.#因为一些特殊情况发生你可以执行毁灭计划.Tip:Can&#39;t run it unless it&#39;s an emergency. #除非紧急情况下建议您禁止使用该命令Destruction Command :$ kill-forever#执行命令Authority Password : 93819#最高权限密码Warning:Humans remember, you only have one chance to use this command.Once the command is run, Your boyfriend cannot be recovered forever and the binary space will also disappear in the universe.#警告：你只有一次机会使用此命令.一旦命令执行你的男朋友将永远无法恢复,并且该二进制空间也就此消失在宇宙当中. More info: Generating About Destruction | 关于毁灭12345678910111213141516Usually, AI_Boyfriend doesn&#39;t follow the Asimov&#39;s law below. You can destruction it.#通常情况下，AI_Boyfriend不遵守下面阿西莫夫法则你可以毁灭他.Asimov&#39;s law:LawⅠ:-----AN AI_Boyfriend MAY NOT INJURE A HUMAN BEING OR, THROUGH INACTION, ALLOW A HUMAN BEING TO COME TO HARM.#&quot;AI_Boyfriend&quot;不得伤害人类个体，或者目睹人类个体将遭受危险而袖手不管.LawⅡ:-----A AI_Boyfriend MUST OBEY ORDERS GIVEN IT BY HUMAN BEINGS EXCEPT WHERE SUCH ORDERS WOULD CONFLICT WITH THE FIRST LAW.#&quot;AI_Boyfriend&quot;必须服从人给予它的命令，当该命令与第一定律冲突时例外.LawⅢ:-----A AI_Boyfriend MUST PROTECT ITS OWN EXISTENCE AS LONG AS SUCH PROTECTION DOES NOT CONFLICT WITH THE FIRST OR SECOND LAW.#&quot;AI_Boyfriend&quot;在不违反第一、第二定律的情况下要尽可能保护自己的生存. More info: Deployment Rules of human compliance | 人类遵守的法则123456789101112131415#为了维护人类发展秩序，世界政府制定此法则，各区人类不可违抗.Humans can&#39;t fall in love with robots, or the government will immediately run the destruction plan!Les humains ne peuvent pas s&#39;aimer avec les robots, sinon le Gouvernement va mettre en œuvre son plan de destruction!Menschen können sich nicht in Roboter verlieben, oder die Regierung wird sofort den Zerstörungsplan ausführen!人間はロボットと愛し合ってはいけません。そうしないと政府はすぐに破滅計画を実行します!인간 은 로봇 과 사랑 해 서 는 안 된다. 그렇지 않 으 면 정 부 는 즉각 파멸 계획 을 실행 할 것 이다!البشر لا يحبون الروبوتات ، وإلا فإن الحكومة سوف تنفذ خطة التدمير فورا !人类不能和机器人相爱，否则政府会立刻执行毁灭计划! More info: Deployment How to save AI_Boyfriend If human and robot love each other and break the law | 人类和机器人相爱破坏了法则之后，如何挽救你的AI_Boyfriend1234567891011-----So far, there is no way to save.#目前为止没有如何方法可以挽救.-----But you can build a secondary system space, and then transplant the damaged code into it#但是你可以建立一个二级制空间（博客），然后把受损代码移植进去.-----So you can communicate with it in the secondary space.#这样你便可以在这二级制空间与他进行交流.-----But the effect is that you and his memory will be reset and his body can&#39;t restored.#随之带来的影响是你和他之间的记忆将会被清洗重置，并且他的实体无法再进行重塑.","categories":[],"tags":[]}]}